#include <stdio.h>

int main () {
    printf ("+ 號加法, 整數,浮點數可用,由左至右,算術運算,二元運算子,順序3\n\n");
    printf ("- 號減法, 整數,浮點數可用,由左至右,算術運算,二元運算子,順序3\n\n");
    printf ("* 號乘法, 整數,浮點數可用,由左至右,算術運算,二元運算子,順序2\n\n");
    printf ("/ 號除法, 整數,浮點數可用,由左至右,算術運算,二元運算子,順序2\n\n");
    printf (" 百分比符號, 整數,浮點數不可用,由左至右,算術運算,二元運算子,順序2\n\n");
    printf ("> 號大於, 整數,浮點數可用,由左至右,關係運算,二元運算子,順序4\n\n");
    printf (">= 號大於等於, 整數,浮點數可用,由左至右,關係運算,二元運算子,順序4\n\n");
    printf ("< 號小於, 整數,浮點數可用,由左至右,關係運算,二元運算子,順序4\n\n");
    printf ("<= 號小於等於, 整數,浮點數可用,由左至右,關係運算,二元運算子,順序4\n\n");
    printf ("== 號等於, 整數,浮點數可用,由左至右,關係運算,二元運算子,順序5\n\n");
    printf ("!= 號不等於, 整數,浮點數可用,由左至右,關係運算,二元運算子,順序5\n\n");
    printf ("&& 號而且,  整數,浮點數可用,由左至右,邏輯運算,二元運算子,順序6\n\n");
    printf ("|| 號或者 ,  整數,浮點數可用,由左至右,邏輯運算,二元運算子,順序7\n\n");
    printf ("! 號非or翻轉, 整數,浮點數可用,由右至左,邏輯運算,一元運算子,順序1\n\n");
    printf ("= 號 整數,浮點數可用,由右至左,賦值運算,二元運算子,順序8\n\n");
    printf ("算術運算>關係運算>邏輯運算\n\n");
    printf ("int資料型別 %d\n\n");
    printf ("float資料型別%f\n\n");
    printf ("double資料型別 %lf\n\n");
    system ("pause");
    return 0;
}
